{"metadata": {"author": "LinkedIn", "creation_date": "2023-06-02 16:09:08", "producer": "Apache FOP Version 2.2", "subject": "Resume generated from profile", "title": "Resume"}, "data": {"name": "Carlos Manuel Soares", "title": "Card)", "contacts": {"address": "Lisboa, Lisbon, Portugal", "phone": ["+351 969 571 027", "+44 20 8638 8170  (Work)"], "email": ["carlos@cmpsoares.com"], "urls": ["www.linkedin.com/in/cmpsoares", "www.cmpsoares.com/", "github.com/cmpsoares91/", "stackexchange.com/"]}, "summary": "As a computer science engineer with a multicultural background, I bring a unique perspective to the world of technology. Throughout my career, I have honed my technical skills in areas such as programming, system administration, DevOps, and cloud infrastructure while also developing my leadership and project management abilities. What sets me apart is my passion for continuous learning and my willingness to take on new challenges. Every opportunity is a chance to improve myself and make a difference, and I am always seeking ways to stand out from the crowd. If you're looking for a driven and knowledgeable professional to join your team or collaborate on a project, I would be thrilled to connect with you. Let's work together to achieve our goals and create a brighter future.", "skills": {"top_skills": ["OpenAI", "ChatGPT", "Terraform"], "languages": {"Portuguese": "Native or Bilingual", "Dutch": "Native or Bilingual", "English": "Professional Working", "Francês": "Elementary"}, "certifications": "", "education": [{"school": "ISCTE - Instituto Universitário de Lisboa", "degree": "Master of Engineering (M.Eng.), Computer Engineering", "attendance": {"text": "2014 - 2016", "start": "2014", "end": "2016"}}, {"school": "Instituto Superior Manuel Teixeira Gomes", "degree": "Bachelor's degree, IT Engineer, IT Engineer", "attendance": {"text": "2011 - 2014", "start": "2011", "end": "2014"}}, {"school": "Escola Secundária Poeta António Aleixo", "degree": "High School, Science", "attendance": {"text": "2007 - 2010", "start": "2007", "end": "2010"}}], "skills": {"technologies": "", "industry": "", "other": ""}}, "experience": [{"company": "CMPSOARES LDA.", "title": "Chief Executive Officer", "dates": {"text": "November 2020 - Present  (2 years 8 months)", "start": "November 2020", "end": "Jun 2023", "duration": "2 years 8 months", "present": true}, "location": "Lisbon, Portugal", "description": "CMPSOARES is a consulting company dedicated to assisting companies in developing the services they need. We focus on digitally transforming the business and helping to migrate to the cloud, renew legacy applications and train professionals in achieving the latest practices in productivity, devops, distributed systems, cloud software and specialized AI solutions. Skills & tools: - Business Management: Finance, Marketing, Operations - Web Development: Hugo, WordPress, Woo Commerce, HTML, CSS, Flutter    - Infrastructure Management: Ansible, Docker, Kubernetes, AWS, Raspberry PI, terraform  - Service Development: Go, Python, Dart - Blockchain Technologies: Chia Network, Helium Network - Integrations: Telegram API, Discord API, TIDIO, Binance API, OpenAI API - Training Professionals: Microservices, Docker, YAML, Kubernetes, DevOps"}, {"company": "Avenue Code", "title": "DevOps Engineer", "dates": {"text": "September 2022 - March 2023  (7 months)", "start": "September 2022", "end": "March 2023", "duration": "7 months", "present": false}, "location": "Avenue Code is a global software consulting firm that helps businesses", "description": "navigate the digital landscape and create meaningful customer experiences. They offer a range of services, including digital strategy, product design, engineering, and data analytics, and work with clients across various industries to deliver innovative solutions that drive business results. Avenue Code prides itself on its agile, collaborative approach and commitment to delivering value to its clients through a culture of continuous learning and improvement. Subcontracted by AC as a service provider for their clients on DevOps, IaC and Continuous Integration."}, {"company": "Truphone", "title": "DevOps Engineer", "dates": {"text": "September 2022 - February 2023  (6 months)", "start": "September 2022", "end": "February 2023", "duration": "6 months", "present": false}, "location": "Lisbon, Portugal", "description": "Truphone is a global telecommunications company that offers innovative mobile technology solutions for individuals and businesses. Founded in 2006, Truphone has developed a range of advanced products and services that use eSIM technology to provide seamless, secure, and cost-effective connectivity worldwide. Truphone operates in over 190 countries, providing local connectivity for voice, data, and SMS services, as well as IoT solutions for businesses. The company has developed partnerships with major mobile operators, which allows it to provide a seamless user experience to its customers, regardless of their location. Truphone's services and solutions are designed to meet the needs of a wide range of users, from individual consumers to large enterprises. With a focus on innovation, security, and customer service, Truphone is well-positioned    to continue to lead the industry in the development of cutting-edge mobile technology solutions. Team: TWS - Build/Continuous Integration Responsibilities: - Design, integrate, deploy, and maintain the core infrastructure and systems (GitLab and Nexus instances and their pipelines) - Deliver the tools to enable the best developer experience. - Automate all routine work (toil), eliminating human intervention from repetitive mechanical activity - Create and maintain relevant documentation for peers and users (e.g., handbooks, tutorials) - Support other engineering teams, onboarding, advocating for best practices and assisting in debugging production outages - Support the commitment with high availability and reliability, participating in 24x7 on-call production support Skills & tools: - Virtualized compute infrastructure (VMware ESXi) - Infrastructure as Code (IaC) and config management/automation (Terraform and Ansible) - Continuous Integration (GitLab and Nexus)  - Linux system administration (Bash, systemd, etc.) - Public cloud services (AWS) - Large-scale distributed systems"}, {"company": "Siemens Digital Industries Software", "title": "Senior Cloud Engineer", "dates": {"text": "January 2022 - August 2022  (8 months)", "start": "January 2022", "end": "August 2022", "duration": "8 months", "present": false}, "location": "Lisbon, Portugal", "description": "SIEMENS Digital Industries Software is driving transformation to enable a digital enterprise where engineering, manufacturing and electronics design meet tomorrow. They develop solutions that help companies of all sizes create and leverage digital twins that provide organisations with new insights, opportunities and levels of automation to drive innovation. Team: AISA – Artificial Intelligence Software Applications Responsibilities: - Manage and improve the teams’ Data Science Infrastructure - Design and architect new solutions from ETL to Storage to AI    - Assist with client inquiries and support cases Skills & tools: - Team Management: Assisting the team leads with Agile frameworks and ideas to make the team more efficient - Architecture: System Architecture Analise and Designing Improvements - Infrastructure Management: Ansible, Terraform, Docker, Gitlab, AWS (Organization management, Config, CodeCommit, CodePipeline, Systems Manager Automation, SageMaker, CloudFormation) - Development: Python"}, {"company": "Findmore Consulting, S.A.", "title": "Senior DevOps Engineer", "dates": {"text": "October 2020 - August 2022  (1 year 11 months)", "start": "October 2020", "end": "August 2022", "duration": "1 year 11 months", "present": false}, "location": "Lisbon, Lisbon, Portugal", "description": "Findmore Consulting S.A. is a company specialized in Information Technologies and process excellence namely professional services, nearshoring, software development, UX/UI Design and PMO (Project Management Office). Team: OutCloud Responsibilities: At Findmore my main responsibilities are to provide technical expertise to their clients and to assist with technical assessment in the recruitment process whenever it regards roles and projects related to Site Reliability, DevOps, Cloud Infrastructure and Software Engineering."}, {"company": "OutSystems", "title": "Senior DevOps Engineer", "dates": {"text": "October 2020 - December 2021  (1 year 3 months)", "start": "October 2020", "end": "December 2021", "duration": "1 year 3 months", "present": false}, "location": "Lisbon, Lisbon, Portugal", "description": "The OutSystems modern application platform empowers customers to build, deliver, manage and evolve the software that makes a difference to their business. With high-productivity, AI-assisted tools, customers are able to quickly tackle any strategic challenge such as application modernization, workplace innovation, business process automation, and customer experience transformation. The OutSystems platform also ensures solutions are secure, resilient, cloud-native, built to scale, and most importantly, are able to be continuously evolved.    Team: R&D DevOps Experts Responsibilities: - Serve as an evangelist, mentor, knowledge resource, and trainer for R&D Developers. Share the knowledge about our automated processes and tools to all R&D teams. - Use your knowledge to advocate for the development and Continuous Delivery best practices. - Research and implement automation tools to replace existing manual processes and maintenance tasks. - Design, develop, test and evolve systems and tools to support a fast pace team environment.  Skills & tools: - Continuous Improvement and Delivery (DevOps): Terraform, Ansible, Azure DevOps, Docker, Git, Kubernetes - Scripting/Programming languages: Python, Go, Bash and Shell - Cloud Infrastructure: AWS - Virtualization: Parallels  - Agile Development Lifecycle and tools: Atlassian JIRA, Confluence, Github, Miro - DistributedSystem and Application Architecture Analise and Designing Improvements"}, {"company": "Sky Technology Centre - Portugal", "title": "Senior Site Reliability Engineer", "dates": {"text": "March 2020 - September 2020  (7 months)", "start": "March 2020", "end": "September 2020", "duration": "7 months", "present": false}, "location": "Lisbon Metropolitan Area", "description": "At Sky Technology Centre – Portugal, we’re part of Europe’s leading entertainment company. Our business has grown to include: Broadband and Talk products, OTT streaming services, and now mobile. Team: Olisipo Reliability Team Responsibilities: The Olisipo Reliability Team is responsible to develop/setup and maintain common infrastructure, tools and Databases for both Sky and NBCU based projects (i.e. NBCU’s Peacock Streaming Platform), as well as to support development teams with their infrastructure related tasks and their design decisions for reliable services. These can include, common service and    infrastructure development and rollout, infrastructure provisioning, incident callouts, new deployment rollouts and configuration management. Skills & tools: - Continuous Improvement and Delivery (DevOps): Terraform, Ansible, Jenkins, Docker, Git, Groovy, Kubernetes - Scripting/Programming languages: Python, Go, Bash and Shell - Cloud Infrastructure: AWS - Virtualized Infrastructure: vSphere, IPplan, Akamai - Site Reliability Observability: Prometheus, Grafana, Elasticsearch, Kibana - Security: Qualys - Agile Development Lifecycle and tools: Atlassian JIRA, Confluence, Github - System and Application Architecture Analise and Designing Improvements, Spark, xMatters - Systems Administration, IT systems, Networking and IT Operations"}, {"company": "VAKT Global Ltd", "title": "Cloud Infrastructure & DevOps Engineer", "dates": {"text": "April 2019 - February 2020  (11 months)", "start": "April 2019", "end": "February 2020", "duration": "11 months", "present": false}, "location": "Lisboa e Região, Portugal", "description": "VAKT is building a post-trade commodities platform underpinned by Blockchain technology that will improve efficiency, drive industry standardisation and ultimately cause disruption in the commodities markets. VAKT is a uniquely placed super start-up, backed and well-funded by a consortium of Oil Majors, Trading Houses and banks (ABN AMRO, BP, Chevron, Equinor, Gunvor, ING Bank, KOCH Industries Inc., Mercuria, Reliance Industries Ltd., Shell, Societé Generale, Total, Saudi Aramco). Team: Infrastructure & DevOps Responsibilities: The Cloud Infrastructure Engineering team is accountable for the provision of cloud, infrastructure and platform services to underpin the smooth running of the VAKT platform. We’re involved in all aspects of design, delivery, deployment and maintenance of the platform. Working closely with the development teams to ensure the integrity of the production and development environments, providing infrastructure as a service and supporting the delivery pipeline in a DevOps model using the latest tools, technologies and approaches. Skills & tools:    - Continuous Improvement and Delivery (DevOps): Terraform, Ansible, Concourse, Jenkins, Docker, Git, Maven - Scripting/Programming languages, such as: Python, Ruby, Go, Bash and Shell - Cloud Infrastructure: AWS - Site Reliability Observability: Prometheus, Grafana, Elasticsearch, Kibana, Cloudwatch - Security: Snyke, Cloudtrail - Blockchain, Ethereum, Solidity, Quorum - Agile Development Lifecycle and tools: Atlassian JIRA, FunRetro - IaaS, PaaS, SaaS  - System and Application Architecture Analise and Designing Improvements - Systems Administration, IT systems, Networking and IT Operations"}, {"company": "PASS S.A.", "title": "Senior Site Reliability Engineer", "dates": {"text": "January 2019 - February 2019  (2 months)", "start": "January 2019", "end": "February 2019", "duration": "2 months", "present": false}, "location": "Lisboa e Região, Portugal", "description": "PASS S.A. is a Fintech with an enthusiastic team focused in developing and implementing software based algorithmic solutions for quantitative investment strategies and systematic trading operations environment. Team: Infrastructure & Services Responsibilities: - Implement a Monitoring Solution (Elasticsearch, Kibana, Beats, Python) - Support and Maintain Python Microservices (Order Management, Data Stream, Real-time Reporting) - Server Administration, Configuration, Deployment Management, DevOps (Docker, Git, GitLab, Bash, Python, Ubuntu Server LTS 18.04)"}, {"company": "- System and Application Architecture Analise and Designing Improvements", "title": "BNP Paribas", "dates": {"text": "3 years 10 months", "start": "3 years 10 months", "end": "3 years 10 months", "duration": "0 years", "present": false}, "location": "Senior Site Reliability & Release Manager", "description": ""}, {"company": "3 years 10 months", "title": "Senior Site Reliability & Release Manager", "dates": {"text": "May 2018 - January 2019  (9 months)", "start": "May 2018", "end": "January 2019", "duration": "9 months", "present": false}, "location": "Lisbon Area, Portugal", "description": "Team: Application and Production Support – IT Functions Responsibilities:    - Development and DevOps to assist in Infrastructure Management and Agent Deployments (Shell Scripting, Perl, Node.JS, Java, Maven, SVN, GIT, Jenkins, Nexus, Sonar); - Tool & Database Administration (JIRA, MySQL); - System Administration (Red Hat Enterprise Linux, Apache HTTPd, Tomcat, Scripting, vCenter); - Cloud Infrastructure (AWS); - Managing Agent Deployment on the group servers (approx. 1200 servers: Different versions of Red Hat Enterprise Linux, HP-UX, AIX, Solaris and Windows Server); - Participate in the technical architecture, design and development decisions for other solutions; - Application Support;"}, {"company": "- Training development and supervision.", "title": "IT Application Manager & Data Engineer - SRE Tooling", "dates": {"text": "October 2016 - May 2018  (1 year 8 months)", "start": "October 2016", "end": "May 2018", "duration": "1 year 8 months", "present": false}, "location": "Lisbon Area, Portugal", "description": "Team: Peach - Infrastructure and Application Monitoring Project Responsibilities: - Application/Project Management; - Development, DevOps and Configuration (Java, Maven, JIRA, SVN, GIT, Jenkins, Nexus, Sonar, Adobe Air, Apache Kafka, Elastic Stack, JavaScript, HTML, ReactJS and ElectronJS); - Database Administration and Development (MySQL, Elasticsearch, CouchDB); - System Administration (Red Hat Enterprise Linux, Apache HTTPd, Tomcat, Scripting, Center); - Cloud Infrastructure (AWS); - Participate in the design and development of other Monitoring Solutions; - Application Support; - User access/roles Management; - Training development and supervision;"}, {"company": "- Technical Roadmap analysis and development.", "title": "Technical Leader & Site Reliability Engineer", "dates": {"text": "April 2016 - October 2016  (7 months)", "start": "April 2016", "end": "October 2016", "duration": "7 months", "present": false}, "location": "Lisbon Area, Portugal", "description": "Team: Peach - Infrastructure and Application Monitoring Project Responsibilities: - Application Support;    - Development & Administration (Java, Maven, JIRA, SVN, Adobe Air, JavaScript); - Database Administration and Development (MySQL); - System Administration (Red Hat, Apache, Tomcat, Scripting, vCenter); - Managing Agent Deployment on the group servers (approx. 1200 servers: Different versions of Red Hat Enterprise Linux, HP-UX, AIX, Solaris and Windows Server); - User access/roles Management;"}, {"company": "- Technical Roadmap analysis and development.", "title": "Information System Developer - IT Academy Internship", "dates": {"text": "April 2015 - April 2016  (1 year 1 month)", "start": "April 2015", "end": "April 2016", "duration": "1 year 1 month", "present": false}, "location": "Lisbon Area, Portugal", "description": "Team: Peach - Infrastructure and Application Monitoring Project Responsibilities: - Application Support; - Development (Java, Maven, JIRA, SVN, Adobe Air, JavaScript); - Database Administration and Development (MySQL); - System Administration (Red Hat, Apache, Tomcat, Scripting); - User access/roles Management."}, {"company": "Novabase", "title": "Business Intelligence Consultant, Trainee (Novabase Academy)", "dates": {"text": "November 2014 - January 2015  (3 months)", "start": "November 2014", "end": "January 2015", "duration": "3 months", "present": false}, "location": "Lisbon Area, Portugal", "description": "Data Migration Team, Responsibilities: - Analysis and development of Data Migration Flows - Study new technologies as Proof of Concept projects - Learn the used Project Management Methodologies such as Design Thinking, EPM Induction and Agile - Learn how to work with various ETL and Database technologies (Mostly On- The-Job), such as Informatica PowerCenter, SQL Server, PostgreSQL, Oracle PL\\SQL, batch, VBScripting. Auchan Portugal Hipermercados"}, {"company": "Cashier, Credit Card Promoter/Manager and Insurance Broker (Jumbo", "title": "Card)", "dates": {"text": "June 2012 - June 2014  (2 years 1 month)", "start": "June 2012", "end": "June 2014", "duration": "2 years 1 month", "present": false}, "location": "Portimão Area, Portugal", "description": "Jumbo Card Team, Responsibilities: - Promote the group’s credit services    - Support and Manage Client Accounts - Manage, support and/or fill in for Cashier team when needed."}]}}